; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (domain sailing)
     (:requirements :typing :fluents)
     (:types
          boat person - object
     )
     (:predicates
          (saved ?t - person)
     )
     (:functions
          (x ?b - boat)
          (y ?b - boat)
          (d ?t - person)
     )
     ;; Increment the value in the given counter by one
     (:action go_north_east
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_north_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_est
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 3))
     )
     (:action go_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 3))
     )
     (:action go_south_west
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south_east
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south
          :parameters(?b - boat)
          :precondition (and)
          :effect (and (decrease (y ?b) 2))
     )
     (:action save_person
          :parameters(?b - boat ?t - person)
          :precondition ( and (>= (+ (x ?b) (y ?b)) (d ?t))
               (>= (- (y ?b) (x ?b)) (d ?t))
               (<= (+ (x ?b) (y ?b)) (+ (d ?t) 25))
               (<= (- (y ?b) (x ?b)) (+ (d ?t) 25))
          )
          :effect (and(saved ?t))
     )

)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_12_17)

	(:domain sailing)

	(:objects
		b0 b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 - boat
		p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 - person
	)

  (:init
		(= (x b0) 10)
(= (y b0) 0)
(= (x b1) 7)
(= (y b1) 0)
(= (x b2) -10)
(= (y b2) 0)
(= (x b3) 7)
(= (y b3) 0)
(= (x b4) 7)
(= (y b4) 0)
(= (x b5) 7)
(= (y b5) 0)
(= (x b6) 9)
(= (y b6) 0)
(= (x b7) -6)
(= (y b7) 0)
(= (x b8) 9)
(= (y b8) 0)
(= (x b9) 0)
(= (y b9) 0)
(= (x b10) 7)
(= (y b10) 0)
(= (x b11) -3)
(= (y b11) 0)

		(= (d p0) 26)
(= (d p1) 20)
(= (d p2) 95)
(= (d p3) 65)
(= (d p4) 36)
(= (d p5) 28)
(= (d p6) 14)
(= (d p7) 7)
(= (d p8) 83)
(= (d p9) 70)
(= (d p10) 13)
(= (d p11) 24)
(= (d p12) 41)
(= (d p13) 71)
(= (d p14) 43)
(= (d p15) 50)
(= (d p16) 1)

	)

	(:goal
		(and
			(saved p0)
(saved p1)
(saved p2)
(saved p3)
(saved p4)
(saved p5)
(saved p6)
(saved p7)
(saved p8)
(saved p9)
(saved p10)
(saved p11)
(saved p12)
(saved p13)
(saved p14)
(saved p15)
(saved p16)
		)
	)
)

; plan
1. (go_north_east b9)
   changed: (x b9) from 0 to 1.5, (y b9) from 0 to 1.5
   goals met: 0 of 17
2. (go_north_east b9)
   changed: (x b9) from 1.5 to 3, (y b9) from 1.5 to 3
   goals met: 0 of 17
3. (go_north_east b9)
   changed: (x b9) from 3 to 4.5, (y b9) from 3 to 4.5
   goals met: 0 of 17
4. (go_north_east b9)
   changed: (x b9) from 4.5 to 6, (y b9) from 4.5 to 6
   goals met: 0 of 17
5. (go_north_east b9)
   changed: (x b9) from 6 to 7.5, (y b9) from 6 to 7.5
   goals met: 0 of 17
6. (go_north_east b9)
   changed: (x b9) from 7.5 to 9, (y b9) from 7.5 to 9
   goals met: 0 of 17
7. (go_north_east b9)
   changed: (x b9) from 9 to 10.5, (y b9) from 9 to 10.5
   goals met: 0 of 17
8. (go_north_east b9)
   changed: (x b9) from 10.5 to 12, (y b9) from 10.5 to 12
   goals met: 0 of 17
9. (go_north_west b9)
   changed: (x b9) from 12 to 10.5, (y b9) from 12 to 13.5
   goals met: 0 of 17
10. (save_person b9 p16)
   added: (saved p16)
   goals met: 1 of 17
11. (go_north_east b9)
   changed: (x b9) from 10.5 to 12, (y b9) from 13.5 to 15
   goals met: 1 of 17
12. (go_north_west b9)
   changed: (x b9) from 12 to 10.5, (y b9) from 15 to 16.5
   goals met: 1 of 17
13. (go_north_west b9)
   changed: (x b9) from 10.5 to 9, (y b9) from 16.5 to 18
   goals met: 1 of 17
14. (save_person b9 p7)
   added: (saved p7)
   goals met: 2 of 17
15. (go_north_west b9)
   changed: (x b9) from 9 to 7.5, (y b9) from 18 to 19.5
   goals met: 2 of 17
16. (go_north_west b9)
   changed: (x b9) from 7.5 to 6, (y b9) from 19.5 to 21
   goals met: 2 of 17
17. (save_person b9 p6)
   added: (saved p6)
   goals met: 3 of 17
18. (save_person b9 p10)
   added: (saved p10)
   goals met: 4 of 17
19. (go_north_west b9)
   changed: (x b9) from 6 to 4.5, (y b9) from 21 to 22.5
   goals met: 4 of 17
20. (go_north_west b9)
   changed: (x b9) from 4.5 to 3, (y b9) from 22.5 to 24
   goals met: 4 of 17
21. (save_person b9 p1)
   added: (saved p1)
   goals met: 5 of 17
22. (go_north_west b9)
   changed: (x b9) from 3 to 1.5, (y b9) from 24 to 25.5
   goals met: 5 of 17
23. (save_person b9 p11)
   added: (saved p11)
   goals met: 6 of 17
24. (go_north_west b9)
   changed: (x b9) from 1.5 to 0, (y b9) from 25.5 to 27
   goals met: 6 of 17
25. (save_person b9 p0)
   added: (saved p0)
   goals met: 7 of 17
26. (go_north_east b9)
   changed: (x b9) from 0 to 1.5, (y b9) from 27 to 28.5
   goals met: 7 of 17
27. (go_north_east b9)
   changed: (x b9) from 1.5 to 3, (y b9) from 28.5 to 30
   goals met: 7 of 17
28. (go_north_east b9)
   changed: (x b9) from 3 to 4.5, (y b9) from 30 to 31.5
   goals met: 7 of 17
29. (go_north_east b9)
   changed: (x b9) from 4.5 to 6, (y b9) from 31.5 to 33
   goals met: 7 of 17
30. (go_north_east b9)
   changed: (x b9) from 6 to 7.5, (y b9) from 33 to 34.5
   goals met: 7 of 17
31. (go_north_east b9)
   changed: (x b9) from 7.5 to 9, (y b9) from 34.5 to 36
   goals met: 7 of 17
32. (go_north_east b9)
   changed: (x b9) from 9 to 10.5, (y b9) from 36 to 37.5
   goals met: 7 of 17
33. (go_north_east b9)
   changed: (x b9) from 10.5 to 12, (y b9) from 37.5 to 39
   goals met: 7 of 17
34. (go_north_west b9)
   changed: (x b9) from 12 to 10.5, (y b9) from 39 to 40.5
   goals met: 7 of 17
35. (save_person b9 p5)
   added: (saved p5)
   goals met: 8 of 17
36. (go_north_east b9)
   changed: (x b9) from 10.5 to 12, (y b9) from 40.5 to 42
   goals met: 8 of 17
37. (go_north_east b9)
   changed: (x b9) from 12 to 13.5, (y b9) from 42 to 43.5
   goals met: 8 of 17
38. (go_north_east b9)
   changed: (x b9) from 13.5 to 15, (y b9) from 43.5 to 45
   goals met: 8 of 17
39. (go_north_east b9)
   changed: (x b9) from 15 to 16.5, (y b9) from 45 to 46.5
   goals met: 8 of 17
40. (go_north_east b9)
   changed: (x b9) from 16.5 to 18, (y b9) from 46.5 to 48
   goals met: 8 of 17
41. (go_west b9)
   changed: (x b9) from 18 to 15
   goals met: 8 of 17
42. (go_west b9)
   changed: (x b9) from 15 to 12
   goals met: 8 of 17
43. (save_person b9 p4)
   added: (saved p4)
   goals met: 9 of 17
44. (go_north_east b9)
   changed: (x b9) from 12 to 13.5, (y b9) from 48 to 49.5
   goals met: 9 of 17
45. (go_north_east b9)
   changed: (x b9) from 13.5 to 15, (y b9) from 49.5 to 51
   goals met: 9 of 17
46. (go_north_west b9)
   changed: (x b9) from 15 to 13.5, (y b9) from 51 to 52.5
   goals met: 9 of 17
47. (go_north_west b9)
   changed: (x b9) from 13.5 to 12, (y b9) from 52.5 to 54
   goals met: 9 of 17
48. (save_person b9 p12)
   added: (saved p12)
   goals met: 10 of 17
49. (go_north_west b9)
   changed: (x b9) from 12 to 10.5, (y b9) from 54 to 55.5
   goals met: 10 of 17
50. (save_person b9 p14)
   added: (saved p14)
   goals met: 11 of 17
51. (go_north_east b9)
   changed: (x b9) from 10.5 to 12, (y b9) from 55.5 to 57
   goals met: 11 of 17
52. (go_north_east b9)
   changed: (x b9) from 12 to 13.5, (y b9) from 57 to 58.5
   goals met: 11 of 17
53. (go_north_east b9)
   changed: (x b9) from 13.5 to 15, (y b9) from 58.5 to 60
   goals met: 11 of 17
54. (go_north_west b9)
   changed: (x b9) from 15 to 13.5, (y b9) from 60 to 61.5
   goals met: 11 of 17
55. (go_north_west b9)
   changed: (x b9) from 13.5 to 12, (y b9) from 61.5 to 63
   goals met: 11 of 17
56. (save_person b9 p15)
   added: (saved p15)
   goals met: 12 of 17
57. (go_north_east b9)
   changed: (x b9) from 12 to 13.5, (y b9) from 63 to 64.5
   goals met: 12 of 17
58. (go_north_east b9)
   changed: (x b9) from 13.5 to 15, (y b9) from 64.5 to 66
   goals met: 12 of 17
59. (go_north_east b9)
   changed: (x b9) from 15 to 16.5, (y b9) from 66 to 67.5
   goals met: 12 of 17
60. (go_north_east b9)
   changed: (x b9) from 16.5 to 18, (y b9) from 67.5 to 69
   goals met: 12 of 17
61. (go_north_east b9)
   changed: (x b9) from 18 to 19.5, (y b9) from 69 to 70.5
   goals met: 12 of 17
62. (go_north_east b9)
   changed: (x b9) from 19.5 to 21, (y b9) from 70.5 to 72
   goals met: 12 of 17
63. (go_north_east b9)
   changed: (x b9) from 21 to 22.5, (y b9) from 72 to 73.5
   goals met: 12 of 17
64. (go_west b9)
   changed: (x b9) from 22.5 to 19.5
   goals met: 12 of 17
65. (go_west b9)
   changed: (x b9) from 19.5 to 16.5
   goals met: 12 of 17
66. (go_west b9)
   changed: (x b9) from 16.5 to 13.5
   goals met: 12 of 17
67. (go_west b9)
   changed: (x b9) from 13.5 to 10.5
   goals met: 12 of 17
68. (go_west b9)
   changed: (x b9) from 10.5 to 7.5
   goals met: 12 of 17
69. (save_person b9 p3)
   added: (saved p3)
   goals met: 13 of 17
70. (go_north_east b9)
   changed: (x b9) from 7.5 to 9, (y b9) from 73.5 to 75
   goals met: 13 of 17
71. (go_north_east b9)
   changed: (x b9) from 9 to 10.5, (y b9) from 75 to 76.5
   goals met: 13 of 17
72. (go_north_east b9)
   changed: (x b9) from 10.5 to 12, (y b9) from 76.5 to 78
   goals met: 13 of 17
73. (go_north_east b9)
   changed: (x b9) from 12 to 13.5, (y b9) from 78 to 79.5
   goals met: 13 of 17
74. (go_north_east b9)
   changed: (x b9) from 13.5 to 15, (y b9) from 79.5 to 81
   goals met: 13 of 17
75. (go_west b9)
   changed: (x b9) from 15 to 12
   goals met: 13 of 17
76. (go_north_west b9)
   changed: (x b9) from 12 to 10.5, (y b9) from 81 to 82.5
   goals met: 13 of 17
77. (save_person b9 p9)
   added: (saved p9)
   goals met: 14 of 17
78. (save_person b9 p13)
   added: (saved p13)
   goals met: 15 of 17
79. (go_north_east b9)
   changed: (x b9) from 10.5 to 12, (y b9) from 82.5 to 84
   goals met: 15 of 17
80. (go_north_west b9)
   changed: (x b9) from 12 to 10.5, (y b9) from 84 to 85.5
   goals met: 15 of 17
81. (go_north_west b9)
   changed: (x b9) from 10.5 to 9, (y b9) from 85.5 to 87
   goals met: 15 of 17
82. (go_north_west b9)
   changed: (x b9) from 9 to 7.5, (y b9) from 87 to 88.5
   goals met: 15 of 17
83. (go_north_west b9)
   changed: (x b9) from 7.5 to 6, (y b9) from 88.5 to 90
   goals met: 15 of 17
84. (save_person b9 p8)
   added: (saved p8)
   goals met: 16 of 17
85. (go_north_west b9)
   changed: (x b9) from 6 to 4.5, (y b9) from 90 to 91.5
   goals met: 16 of 17
86. (go_north_west b9)
   changed: (x b9) from 4.5 to 3, (y b9) from 91.5 to 93
   goals met: 16 of 17
87. (go_north_west b9)
   changed: (x b9) from 3 to 1.5, (y b9) from 93 to 94.5
   goals met: 16 of 17
88. (go_north_west b9)
   changed: (x b9) from 1.5 to 0, (y b9) from 94.5 to 96
   goals met: 16 of 17
89. (save_person b9 p2)
   added: (saved p2)
   goals met: 17 of 17
